ГТС/УТГТС/Catalogs/УчетныеЗаписиМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиМаркетплейсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКатегории</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиКатегорийДляМаркетплейса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДанныеТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПродажиЧерезСкладыТорговойПлощадки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПродажиЧерезСкладыСобственные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМагазина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАккаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыРаботыТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройкиСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройкиСсылка</Name>
							<Comment>Состав типов реквизита дополняется по мере необходимости</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсOzon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсWildberries</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсLamoda</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/УчетныеЗаписиМаркетплейсов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("Организация", Организация);
		СтруктураНастроек.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
		СтруктураНастроек.Вставить("ИсточникКатегории", ИсточникКатегории);
		СтруктураНастроек.Вставить("ВалютаУчета", ВалютаУчета);
		СтруктураНастроек.Вставить("ВидыЦен", ВидыЦен.Выгрузить());
		
		ХешНастроек = Справочники.УчетныеЗаписиМаркетплейсов.ПолучитьХешНастроек(СтруктураНастроек);
	КонецЕсли;

	ИзменениеПометкиУдаления = 0;
	Если ПометкаУдаления = Истина И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = Ложь Тогда // Помечается
		ИзменениеПометкиУдаления = 1;
	ИначеЕсли ПометкаУдаления = Ложь И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = Истина Тогда // Снимается
		ИзменениеПометкиУдаления = -1;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ИзменениеПометкиУдаления", ИзменениеПометкиУдаления);
	ДополнительныеСвойства.Вставить("ПредставлениеСсылкиДоИзменения", Строка(Ссылка));

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ИзменениеПометкиУдаления = 0;
	ДополнительныеСвойства.Свойство("ИзменениеПометкиУдаления", ИзменениеПометкиУдаления);

	Если ИзменениеПометкиУдаления = 1 Тогда	// Помечается
		Использование = Ложь;
	ИначеЕсли ИзменениеПометкиУдаления = -1 Тогда	// Снимается
		Использование = Истина;
	КонецЕсли;
	
	ПредставлениеСсылкиДоИзменения = "";
	ДополнительныеСвойства.Свойство("ПредставлениеСсылкиДоИзменения", ПредставлениеСсылкиДоИзменения);
	ИзмененоПредставление = (ПредставлениеСсылкиДоИзменения <> Строка(Ссылка));

	Идентификатор = Ссылка.УникальныйИдентификатор();
	МенеджерОбъекта = Справочники.УчетныеЗаписиМаркетплейсов;

	УстановитьПривилегированныйРежим(Истина);

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		Префиксы = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса(Истина);

		Если ЗначениеЗаполнено(ИзменениеПометкиУдаления) Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьИспользованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Использование);
			КонецЦикла;
		КонецЕсли;

		Если ИзменениеПометкиУдаления = -1 Или ИзмененоПредставление Тогда
			Для Каждого Префикс Из Префиксы Цикл
				ПредставлениеРегламентногоЗадания = ИнтеграцияСМаркетплейсомOzonКлиентСервер.НаименованиеРегламентногоЗадания(Префикс.Значение);
				МенеджерОбъекта.УстановитьНаименованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, ПредставлениеРегламентногоЗадания, Наименование);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		ДоступнаРаботаСОстатками = МенеджерОбъекта.ДоступнаРаботаСОстатками(ВидМаркетплейса, СхемаРаботы);
		Если НЕ ДоступнаРаботаСОстатками Тогда
			МенеджерОбъекта.УдалитьРегламентноеЗадание("ЯндексМаркет_ВыгрузкаОстатковТоваровЯндексМаркет_" + Идентификатор);
		КонецЕсли;

		Префиксы = ИнтеграцияСЯндексМаркетСервер.ПрефиксыРегламентныхЗаданий();

		Если ЗначениеЗаполнено(ИзменениеПометкиУдаления) Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьИспользованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Использование);
			КонецЦикла;
		КонецЕсли;

		Если ИзменениеПометкиУдаления = -1 Или ИзмененоПредставление Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьНаименованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Префикс.Представление, Строка(Ссылка));
			КонецЦикла;
		КонецЕсли;
	
	ИначеЕсли ИнтеграцияСМаркетплейсамиСИ.ЭтоМаркетплейсСИ(ВидМаркетплейса) Тогда
		
		Префиксы = ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПрефиксыРегламентныхЗаданий(ВидМаркетплейса);
		
		Если ИзменениеПометкиУдаления = 1 Тогда
			
			УзлыОбмена = ПланыОбмена.МаркетплейсыСИ.НайтиУзлы(Ссылка, Истина);
			Для Каждого УзелОбмена Из УзлыОбмена Цикл
				УзлыОбменаОбъект = УзелОбмена.ПолучитьОбъект();
				УзлыОбменаОбъект.ПометкаУдаления = Истина;
				УзлыОбменаОбъект.Записать();
			КонецЦикла;
			
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьИспользованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Использование);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИзменениеПометкиУдаления = -1 Или ИзмененоПредставление Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьНаименованиеРегламентногоЗадания(Префикс.Значение + Идентификатор,
				 ИнтеграцияСМаркетплейсамиСИКлиентСервер.НаименованиеРегламентногоЗадания(ВидМаркетплейса, Префикс.Значение),
				 Наименование);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Идентификатор = Ссылка.УникальныйИдентификатор();
	МенеджерОбъекта = Справочники.УчетныеЗаписиМаркетплейсов;

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		Префиксы = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса(Истина);
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		Префиксы = ИнтеграцияСЯндексМаркетСервер.ПрефиксыРегламентныхЗаданий();
	ИначеЕсли ИнтеграцияСМаркетплейсамиСИ.ЭтоМаркетплейсСИ(ВидМаркетплейса) Тогда
		Префиксы = ИнтеграцияСМаркетплейсамиСИКлиентСервер.ПрефиксыРегламентныхЗаданий(ВидМаркетплейса);
	Иначе
		Префиксы = Неопределено;
	КонецЕсли;

	Если Префиксы <> Неопределено Тогда
		Для Каждого Префикс Из Префиксы Цикл
			МенеджерОбъекта.УдалитьРегламентноеЗадание(Префикс.Значение + Идентификатор);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет значение дополнительной настройки для учетной записи торговой площадки.
//
// Параметры:
//   ИдентификаторНастройки - Строка - идентификатор настройки.
//   ЗначениеНастройки      - Произвольный - значение настройки.
//
Процедура ИзменитьДополнительнуюНастройку(ИдентификаторНастройки, ЗначениеНастройки) Экспорт
	
	СтрокаТабличнойЧасти = ДополнительныеНастройки.Найти(ИдентификаторНастройки, "ИдентификаторНастройки");
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = ДополнительныеНастройки.Добавить();
		СтрокаТабличнойЧасти.ИдентификаторНастройки = ИдентификаторНастройки;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеНастройки) = Тип("Булево") 
			Или ТипЗнч(ЗначениеНастройки) = Тип("Дата")
			Или ТипЗнч(ЗначениеНастройки) = Тип("Число") Тогда
		СтрокаТабличнойЧасти.ЗначениеНастройки = ЗначениеНастройки;
	
	ИначеЕсли ТипЗнч(ЗначениеНастройки) = Тип("Строка") Тогда
		СтрокаТабличнойЧасти.ЗначениеНастройкиСтрока = ЗначениеНастройки;
	
	Иначе
		СтрокаТабличнойЧасти.ЗначениеНастройкиСсылка = ЗначениеНастройки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
